# parameters
nc: 8  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12, 16, 19, 36, 40, 28]  # P3/8
  - [36, 75, 76, 55, 72, 146]  # P4/16
  - [142, 110, 192, 243, 459, 401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [256, 3, 2]],  
   [-1, 1, Conv, [512, 1, 1]],

   [-1, 1, ELAN, [512]],
   [-1, 1, MP, [2, 2]], 

   [-1, 1, ELAN, [512]],
   [-1, 1, MP, [2, 2]],

   [-1, 1, ELAN, [512]],
   [-1, 1, MP, [2, 2]],

   [-1, 1, ELAN, [512]],
   [-1, 1, DC, [512]],
   [-1, 1, SPPCSPC, [512]],

   [-1, 1, upsample, [512, 2]],

   [-8, 1, DC, [512, 2]],

   [-1, -2, Concat, [1]],
   [-1, 1, ELAN II, [512, 2]], # need to add the unknown MP2
   [-1, 1, MP, [2, 2]], 

   [-1, -6, Concat, [1]],
   [-1, 1, ELAN II, [512, 2]],
   [-1, 1, RepConv, [256, 3, 1]],
   [-1, 1, SoftNM, []],

   [[102, 103, 104], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]